app/controllers/searches_controller.rb

  def index
    @searches = Search.all
---
SELECT * FROM `searches`

  def show
    #this would normally just show @search but it made sense to show the results as well since the purpose is not just create a search object
    @search = Search.find(params[:id])
---
SELECT * FROM `searches` WHERE (`searches`.`id` = 0)

  def create
    @search = Search.new(params[:search])
    if @search.save
---
INSERT INTO `searches` (`updated_at`, `searchterm`, `normalizedterm`, `keyword_id`, `created_at`) VALUES('2009-05-04 22:39:51', '83441rat', '83441rat', NULL, '2009-05-04 22:39:51')

  def edit
    @search = Search.find(params[:id])
---
SELECT * FROM `searches` WHERE (`searches`.`id` = 953125641)

  def update
    @search = Search.find(params[:id])
---
SELECT * FROM `searches` WHERE (`searches`.`id` = 953125641)

  def destroy
    @search = Search.find(params[:id])
    @search.destroy
---
SELECT * FROM `searches` WHERE (`searches`.`id` = 2)
DELETE FROM `searches` WHERE `id` = 2